In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import math
import warnings; warnings.simplefilter('ignore')
from code_files_feature_extraction import *

%matplotlib inline

In [ ]:
arp_df = pd.read_csv('US_Accidents_June20.csv')

In [3]:
arp_df_ts = arp_df[['ID','Start_Time','City']]
arp_df_ts.head(7)

    ID           Start_Time          City
0  A-1  2016-02-08 05:46:00        Dayton
1  A-2  2016-02-08 06:07:59  Reynoldsburg
2  A-3  2016-02-08 06:49:27  Williamsburg
3  A-4  2016-02-08 07:23:34        Dayton
4  A-5  2016-02-08 07:39:07        Dayton
5  A-6  2016-02-08 07:44:26   Westerville
6  A-7  2016-02-08 07:59:35        Dayton

In [5]:
arp_df_ts.shape

(3513617, 3)

In [18]:
cities = ['Houston', 'Atlanta', 'LosAngeles', 'Charlotte', 'Dallas', 'Austin']
cities_df = arp_df_ts.loc[arp_df_ts['City'].isin(cities)].reset_index(drop=True)

In [19]:
cities_df.shape

(349997, 3)

In [20]:
cities_df.head(18)

          ID           Start_Time     City
0   A-146263  2016-11-30 15:25:27  Atlanta
1   A-146264  2016-11-30 14:42:27  Atlanta
2   A-146265  2016-11-30 16:27:58  Atlanta
3   A-146266  2016-11-30 16:14:20  Atlanta
4   A-146267  2016-11-30 16:13:19  Atlanta
5   A-146268  2016-11-30 15:49:32  Atlanta
6   A-146269  2016-11-30 15:48:26  Atlanta
7   A-146270  2016-11-30 15:11:50  Atlanta
8   A-146271  2016-11-30 14:41:44  Atlanta
9   A-146272  2016-11-30 16:23:57  Atlanta
10  A-146273  2016-11-30 16:25:25  Atlanta
11  A-146274  2016-11-30 13:37:17  Atlanta
12  A-146275  2016-11-30 16:15:14  Atlanta
13  A-146276  2016-11-30 15:46:54  Atlanta
14  A-146277  2016-11-30 15:56:07  Atlanta
15  A-146278  2016-11-30 14:39:49  Atlanta
16  A-146288  2016-11-30 16:46:34  Atlanta
17  A-146290  2016-11-30 17:37:17  Atlanta

In [28]:
arp_df_ts['Date'] = pd.DatetimeIndex(arp_df_ts['Start_Time']).to_period('M')
arp_df_ts.head(7)

    ID           Start_Time     Date
0  A-1  2016-02-08 05:46:00  2016-02
1  A-2  2016-02-08 06:07:59  2016-02
2  A-3  2016-02-08 06:49:27  2016-02
3  A-4  2016-02-08 07:23:34  2016-02
4  A-5  2016-02-08 07:39:07  2016-02
5  A-6  2016-02-08 07:44:26  2016-02
6  A-7  2016-02-08 07:59:35  2016-02

In [35]:
arp_df_ts2['Date'] = pd.DatetimeIndex(arp_df_ts['Start_Time']).to_period('D')
arp_df_ts2.head(2)

    ID           Start_Time        Date
0  A-1  2016-02-08 05:46:00  2016-02-08
1  A-2  2016-02-08 06:07:59  2016-02-08

In [8]:
arp_df_ts.shape

(3513617, 3)

In [36]:
arp_df_ts.drop(['Start_Time'],axis = 1, inplace=True)
arp_df_ts2.drop(['Start_Time'],axis = 1, inplace=True)

In [10]:
arp_df_ts.isnull().sum()

ID      0
Date    0
dtype: int64

In [29]:
arp_df_ts.head(2)

    ID           Start_Time     Date
0  A-1  2016-02-08 05:46:00  2016-02
1  A-2  2016-02-08 06:07:59  2016-02

In [31]:
arp_df_Day = arp_df_ts.groupby('Date')['ID'].count().reset_index()
arp_df_Day.head(2)

      Date    ID
0  2016-02   985
1  2016-03  6329

In [37]:
arp_df_Day2 = arp_df_ts2.groupby('Date')['ID'].count().reset_index()
arp_df_Day2.head(2)

         Date  ID
0  2016-02-08  60
1  2016-02-09  59

In [32]:
arp_df_Day.rename(columns={'ID':'Accidents'}, inplace=True)
arp_df_Day.head(10)

      Date  Accidents
0  2016-02        985
1  2016-03       6329
2  2016-04      18088
3  2016-05      17610
4  2016-06      30527
5  2016-07      45759
6  2016-08      56425
7  2016-09      54664
8  2016-10      55628
9  2016-11      65010

In [38]:
arp_df_Day2.rename(columns={'ID':'Accidents'}, inplace=True)
arp_df_Day2.head(3)

         Date  Accidents
0  2016-02-08         60
1  2016-02-09         59
2  2016-02-10         49

In [21]:
arp_df_Day2.shape

NameError: name 'arp_df_Day2' is not defined

In [33]:
arp_df_Day.to_csv('DailyAccidents2.csv',index=False)

In [39]:
arp_df_Day2.to_csv(r'arp_DailyAccidents.csv',index=False)